app/controllers/articles_controller.rb

  def update
    # binding.pry
    @article = Article.find(params[:id])
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-02-25 02:13:56.911915"], ["id", 1]]